test/Integration/Webservice/Soap/Mock/Request/RateRequest-001.xml

<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ns1="http://scxgxtt.phx-dc.dhl.com/euExpressRateBook/RateMsgRequest" xmlns:ns2="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd" xmlns:ns3="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd">
    <SOAP-ENV:Header>
        <ns2:Security SOAP-ENV:mustUnderstand="1">
            <ns2:UsernameToken>
                <ns2:Username>DeveloperTest</ns2:Username>
                <ns2:Password>G!7sI^0dC^7w</ns2:Password>
                <ns2:Nonce>wuDIWFtphh4rP1RaQiXnhrEwSeY=</ns2:Nonce>
                <ns3:Created>2018-06-29T08:21:14Z</ns3:Created>
            </ns2:UsernameToken>
        </ns2:Security>
    </SOAP-ENV:Header>
    <SOAP-ENV:Body>
        <ns1:RateRequest>
            <RequestedShipment>
                <DropOffType>REQUEST_COURIER</DropOffType>
                <NextBusinessDay>Y</NextBusinessDay>
                <Ship>
                    <Shipper>
                        <StreetLines>1-16-24, Minami-gyotoku</StreetLines>
                        <City>Ichikawa-shi, Chiba</City>
                        <PostalCode>272-0138</PostalCode>
                        <CountryCode>JP</CountryCode>
                    </Shipper>
                    <Recipient>
                        <StreetLines>63 RENMIN LU, QINGDAO SHI</StreetLines>
                        <City>QINGDAO SHI</City>
                        <PostalCode>266033</PostalCode>
                        <CountryCode>CN</CountryCode>
                    </Recipient>
                </Ship>
                <Packages>
                    <RequestedPackages number="1">
                        <Weight>
                            <Value>2</Value>
                        </Weight>
                        <Dimensions>
                            <Length>13</Length>
                            <Width>12</Width>
                            <Height>9</Height>
                        </Dimensions>
                    </RequestedPackages>
                </Packages>
                <ShipTimestamp>2018-11-26T12:00:00GMT-06:00</ShipTimestamp>
                <UnitOfMeasurement>SU</UnitOfMeasurement>
                <Content>NON_DOCUMENTS</Content>
                <DeclaredValue>200</DeclaredValue>
                <DeclaredValueCurrencyCode>USD</DeclaredValueCurrencyCode>
                <PaymentInfo>DDP</PaymentInfo>
                <Account>143816942</Account>
            </RequestedShipment>
        </ns1:RateRequest>
    </SOAP-ENV:Body>
</SOAP-ENV:Envelope>